In [1]:
#Installing and Using Pandas
import pandas
pandas.__version__

'2.2.3'

In [4]:
#Introducing Pandas Objects
import numpy as np
import pandas as pd

In [6]:
#Series
#A Series is a single vector of data(like a Numpy array) with an index that lables each element in the vector
counts=pd.Series([456,1645,564,145])
counts

0     456
1    1645
2     564
3     145
dtype: int64

In [7]:
counts.values

array([ 456, 1645,  564,  145])

In [8]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
bacteria=pd.Series([456,1645,564,145],
    index=['Firmicutes','Proteobacteria','Actinobacteria','Bacteroidetes'])
bacteria

Firmicutes         456
Proteobacteria    1645
Actinobacteria     564
Bacteroidetes      145
dtype: int64

In [11]:
bacteria['Actinobacteria']

np.int64(564)

In [12]:
bacteria[0]

C:\Users\MY PC\AppData\Local\Temp\ipykernel_35484\3591401137.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  bacteria[0]

np.int64(456)

In [13]:
bacteria.name='counts'
bacteria.index.name='phylum'
bacteria

phylum
Firmicutes         456
Proteobacteria    1645
Actinobacteria     564
Bacteroidetes      145
Name: counts, dtype: int64

In [14]:
np.log(bacteria)

phylum
Firmicutes        6.122493
Proteobacteria    7.405496
Actinobacteria    6.335054
Bacteroidetes     4.976734
Name: counts, dtype: float64

In [15]:
bacteria[bacteria>1000]

phylum
Proteobacteria    1645
Name: counts, dtype: int64

In [16]:
bacteria_dict={'Firmicutes':654,'Proteobacteria':4567,'Actinobacteria':654,'Bacteroidetes':154}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 654, 'Proteobacteria': 4567, 'Actinobacteria': 654, 'Bacteroidetes': 154}

Firmicutes         654
Proteobacteria    4567
Actinobacteria     654
Bacteroidetes      154
dtype: int64

In [106]:
#Series as generalized Numpy array
#Series as Specialized Dictionary
#DataFrame:bi-dimensional Series with two (or more) indices
data={"Province":["FL","FL","NH","NH","ZH"],
      "Year":[2013,2014,2015,2013,2014],
      "Literacy":[0.2,0.1,0.5,0.3,0.5]}
print(data)      
data=pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2015, 2013, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2015       0.5
3       NH  2013       0.3
4       ZH  2014       0.5

In [107]:
df=pd.DataFrame(data,columns=["Year","Province","Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2015       NH       0.5
3  2013       NH       0.3
4  2014       ZH       0.5

In [108]:
df['nonsense']=df.Year/df.Literacy
df

   Year Province  Literacy  nonsense
0  2013       FL       0.2   10065.0
1  2014       FL       0.1   20140.0
2  2015       NH       0.5    4030.0
3  2013       NH       0.3    6710.0
4  2014       ZH       0.5    4028.0

In [109]:
df['Serie_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   Year Province  Literacy  nonsense  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2014       FL       0.1   20140.0              1
2  2015       NH       0.5    4030.0              2
3  2013       NH       0.3    6710.0              3
4  2014       ZH       0.5    4028.0              4

In [110]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2015, 3: 2013, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0, 1: 20140.0, 2: 4030.0, 3: 6710.0, 4: 4028.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [111]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy  nonsense  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2014       FL       0.1   20140.0              1
2  2015       NH       0.5    4030.0              2
3  2013       NH       0.3    6710.0              3
4  2014       ZH       0.5    4028.0              4

In [86]:
#DataFrame as Specialized dictionary
#From a list of dicts
data=[{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [87]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [88]:
#From a two-dimensionalNumpy array
pd.DataFrame(np.random.randint(2,12),
             columns=['foo','bar'],
             index=['a','b','c'])

   foo  bar
a    9    9
b    9    9
c    9    9

In [89]:
#The Pandas Index OBject
import pandas as pd
import numpy as np
ind=pd.Index([20,35,54,6,1,5])
ind

Index([20, 35, 54, 6, 1, 5], dtype='int64')

In [90]:
#Index as immutable array
ind[1]

np.int64(35)

In [91]:
ind[::]

Index([20, 35, 54, 6, 1, 5], dtype='int64')

In [92]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

6 (6,) 1 int64

In [93]:
ind[1]=0

TypeError: Index does not support mutable operations

In [94]:
#Operating on Data in Pandas
#Ufuncs:Index Preservation
rng=np.random.RandomState(15)
ser=pd.Series(rng.randint(0,10,4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [95]:
dfr=pd.DataFrame(rng.randint(0,10,(5,4)),
                 columns=['A','B','C','D'])
dfr

   A  B  C  D
0  0  7  5  6
1  1  7  0  4
2  9  7  5  3
3  6  8  2  1
4  1  0  5  2

In [96]:
np.sin(dfr*np.pi/4)

          A             B         C             D
0  0.000000 -7.071068e-01 -0.707107 -1.000000e+00
1  0.707107 -7.071068e-01  0.000000  1.224647e-16
2  0.707107 -7.071068e-01 -0.707107  7.071068e-01
3 -1.000000 -2.449294e-16  1.000000  7.071068e-01
4  0.707107  0.000000e+00 -0.707107  1.000000e+00

In [97]:
#Universal Functions:Index Alignment
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area') 
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name='population') 
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [98]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [99]:
A=pd.Series([2,4,6],index=[0,1,2])
B=pd.Series([1,3,5],index=[1,2,3])
print(A)
print(B)
B
A+B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [100]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [112]:
#Ufuncs:Operations Between DataFrame and Series
#Data Wrangling
#Merge Operations
print(df)

   Year Province  Literacy  nonsense  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2014       FL       0.1   20140.0              1
2  2015       NH       0.5    4030.0              2
3  2013       NH       0.3    6710.0              3
4  2014       ZH       0.5    4028.0              4

In [113]:
df

   Year Province  Literacy  nonsense  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2014       FL       0.1   20140.0              1
2  2015       NH       0.5    4030.0              2
3  2013       NH       0.3    6710.0              3
4  2014       ZH       0.5    4028.0              4

In [114]:
df2=pd.DataFrame({"Province":["FL","NH","ZH"],"Population":["100000","200000","300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [115]:
df.merge(df2)#Merge as smart! If there are overlapping names,it uses those for the merge

   Year Province  Literacy  nonsense  Serie_aligned Population
0  2013       FL       0.2   10065.0              0     100000
1  2014       FL       0.1   20140.0              1     100000
2  2015       NH       0.5    4030.0              2     200000
3  2013       NH       0.3    6710.0              3     200000
4  2014       ZH       0.5    4028.0              4     300000

In [116]:
df3=pd.DataFrame({"province":["FL","NH"],"Population":["100000","200000",]})
df3
df.merge(df3,right_on='province',left_on='Province')

   Year Province  Literacy  nonsense  Serie_aligned province Population
0  2013       FL       0.2   10065.0              0       FL     100000
1  2014       FL       0.1   20140.0              1       FL     100000
2  2015       NH       0.5    4030.0              2       NH     200000
3  2013       NH       0.3    6710.0              3       NH     200000

In [117]:
df4=pd.DataFrame({"Province":["FL","NH","UT"],"population":["100000","200000","50000"]})
df.merge(df4,how='outer')

     Year Province  Literacy  nonsense  Serie_aligned population
0  2013.0       FL       0.2   10065.0            0.0     100000
1  2014.0       FL       0.1   20140.0            1.0     100000
2  2015.0       NH       0.5    4030.0            2.0     200000
3  2013.0       NH       0.3    6710.0            3.0     200000
4     NaN       UT       NaN       NaN            NaN      50000
5  2014.0       ZH       0.5    4028.0            4.0        NaN

In [121]:
df5=pd.DataFrame({"Province":["FL","NH","FL"],"population":["100000","200000","50000"]})
print(df)
df.merge(df5,how='outer')

   Year Province  Literacy  nonsense  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2014       FL       0.1   20140.0              1
2  2015       NH       0.5    4030.0              2
3  2013       NH       0.3    6710.0              3
4  2014       ZH       0.5    4028.0              4

   Year Province  Literacy  nonsense  Serie_aligned population
0  2013       FL       0.2   10065.0              0     100000
1  2013       FL       0.2   10065.0              0      50000
2  2014       FL       0.1   20140.0              1     100000
3  2014       FL       0.1   20140.0              1      50000
4  2015       NH       0.5    4030.0              2     200000
5  2013       NH       0.3    6710.0              3     200000
6  2014       ZH       0.5    4028.0              4        NaN

In [124]:
#Combining data with overlap
serie_a=pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                  index=['f','e','d','c','b','a'])
serie_b=pd.Series(np.arange(len(serie_a),dtype=np.float64),
                            index=['f','e','d','c','b','a'])

In [125]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [126]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [127]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [128]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64